module Laurent
export xcː, xvː, log10Xː, σclassicalː, σː, ϕː

function xcː(α,ν,s)
    κ = 3ν
    (α^2 * s / κ)^(1/8)
end

function xvː(α,ν)
    return (α/3/ν)^(1/3)
end

function log10Xː(α,ν,s)
    return -log10(α^2 / (3ν)^5 / s^3)
end

function σclassicalː(x;α=1,ν=1/3)
    top = -α 
    bottom = 9*ν*abs(x^3)
    xv = xvː(α,ν)
    if abs(x)/xv > 0.01
        return exp(top/bottom)
    else
        return 0.0
    end
end

function σː(x;α=1,ν=1/3,s=1)
    x = abs(x)
    κ=3ν
    σ0 = 1
    σ3 = -(α/3/κ)
    σ6 = α^2 /18 /κ^2
    σ8 = α^2 * s / κ
    σ9 = -α^3 / 162 / κ^3
    σ11 = -(14/33) * α^3 * s / κ^2
    σ12 = (1/1944) * α^4 / κ^4
    σ14 = (51/594) * α^4 * s / κ^3
    σ15 = (-1/29160) * α^5 / κ^5
    σ16 = α^4 * s^2 / κ^2
    σ17 = -(1/162 + 51/594/17) * α^5 * s / κ^4 # 10/891
    σ18 = (1/29160/18) * α^6 / κ^6 # 524880
    σ19 = -(14/33 + 1/19) * α^5 * s^2 / κ^3 # 299/627
    σ20 = (1/1944) * α^6 * s / κ^5 - α/(20κ) * σ17 # -1/21384
    #
    if (x ≥ xcː(α,ν,s))
        #σ  = σ0 + σ3/x^3 + σ6/x^6 + σ8/x^8 + σ9/x^9
        #σ += σ11/x^11 + σ12/x^12 + σ14/x^14 + σ15/x^15
        #σ += σ16/x^16 + σ17/x^17 + σ18/x^18 + σ19/x^19 + σ20/x^20
        σ  = σ0 + σ3/x^3 + σ6/x^6 + σ9/x^9
        σ += σ12/x^12 + σ15/x^15
        σ += σ18/x^18 
        return σ
    else
        return 0.0
    end
end

function ϕː(x;α=1,ν=1/3,s=1)
    side = sign(x); x = abs(x)
    κ = 3ν
    ϕ4 = -α
    ϕ7 = α^2 /3 /κ
    ϕ10 = -α^3 /18 /κ^2
    ϕ12 = -α^3 * s / κ
    ϕ13 = α^4 / 162 / κ^3
    ϕ15 = (14/33) * α^4 * s / κ^2
    ϕ16 = (-1/1944) * α^5 / κ^4
    #
    if (x ≥ xcː(α,ν,s))
        ϕ  = ϕ4/x^4 + ϕ7/x^7 + ϕ10/x^10 + ϕ12/x^12 
        ϕ += ϕ13/x^13 + ϕ15/x^15 + ϕ16/x^16
        return ϕ * side
    else
        return 0.0
    end
end

end#module